
// "A": "1",
//  "E": "5",
//  "I": "9",
//  "O": "15",
// "U": "21",
// "Y": "25",
//Дан массив целых чисел требуеться заменить числа на 
//гласные буквы соответствующие алфавиту
let = num[1, 5, 9, 15, 21, 25, 10, 8, 26];

giv();

function swap() { // заменяет номер согласной буквы на согласную букву
    for (let i = 0; i < num; i++) {
        if (num[i] == 1) {

        }

        else if (num[i] == 5) {

        }

        else if (num[i] == 9) {

        }
        else if (num[i] == 15) {

        }

        else if (num[i] == 21) {

        }

        else if (num[i] == 25) {

        }
    }
}


function giv(num) { //выводит массив

    for (let v = 0; v < num; v++) {
        console.log(num[v]);
    }

}